docs: 更新 README 图片
