--- a/README.md
+++ b/README.md
@@ -6,29 +6,29 @@
 
 ## 系统架构
 
-```text
-+-----------+       +--------------------------+         +----------------+
-| 本地网页  | <---> |    FastAPI API 服务     |   <----> |   钉钉机器人   |
-| index.html|  ajax | /api/status 实时查询     | webhook |  查询/关注/全部 |
-+-----------+       +------------+-------------+         +----------------+
-                                 ^
-                                 |
-                                 v
-                      +----------------------+
-                      |    Fetcher（实时）   |
-                      +----------------------+
-                                 ^
-                                 |
-                                 |
-                     +-----------+------------+
-                     |      iOS 快捷指令       |
-                     |------------------------|
-                     | 1. 关注点快速查询         |
-                     +------------------------+
+```mermaid
+flowchart TD
 
+    A["iOS 快捷指令<br/>1. 关注点快速查询"]
+
+    B["本地网页<br/>index.html<br/>(AJAX)"]
+
+    C["FastAPI API 服务<br/>/api/status 实时查询"]
+
+    D["钉钉机器人<br/>查询 / 关注 / 全部"]
+
+    E["Fetcher<br/>实时抓取"]
+
+    %% 连接关系
+    A --> |查询| C
+
+    B <--> |AJAX| C
+
+    D --> |webhook| C
+
+    C --> |使用数据| E
+    E --> |实时数据写入| C
 ```
-
-- 地图使用 OpenStreetMap 瓦片图层，并使用 WGS84 坐标系，为解决国内地图坐标偏移问题，使用了 [wandergis/coordtransform](https://github.com/wandergis/coordtransform) 提供了百度坐标（BD09）、国测局坐标（火星坐标，GCJ02）、和WGS84坐标系之间的转换函数
 
